const friends = ["mango", "poly", "kiwi", "ajax"];
let string = "";

for (let i = 0; i < friends.length; i++) {
  string += friends[i];
  if (i < friends.length - 1) {
    string += ",";
  }
}

console.log(string); 


const friends1 = ["mango", "poly", "kiwi", "ajax"];
let string1 = "";


string1 = friends1.join(",");

console.log(string1);

// ==========================================================1================================================

const cards = ["карточка-1", "карточка-2", "карточка-3", "карточка-4", "карточка-5",]



// ==========================================================2================================================

const elementToRemove = "карточка-3";

let index = cards.indexOf(elementToRemove);

if (index != -1) {
  cards.splice(index, 1);
}

console.log(cards);

// ==========================================================3================================================
const cards1 = ["карточка-1", "карточка-2", "карточка-3", "карточка-4", "карточка-5",]

cards1.splice(5, 0, "Карточка-6")

console.log (cards1)
// ==========================================================4================================================
const cards2 = ["карточка-1", "карточка-2", "карточка-3", "карточка-4", "карточка-5",]

cards2.splice(3, 1, "карточка-4 new")

console.log(cards2)

// ==========================================================5================================================
